In [2]:
import pandas as pd

In [4]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [9]:
lst=[1,2,3,4,5]
df=pd.DataFrame(lst)
df

   0
0  1
1  2
2  3
3  4
4  5

In [11]:
lst1=[[1,2,3,4],[5,6,7,8]]
df=pd.DataFrame(lst1)
df

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [4]:
dct=[{'a':1,'b':2,'c':3,'d':4},{'a':5,'b':6,'c':7,'d':8}]
df=pd.DataFrame(dct)
df

   a  b  c  d
0  1  2  3  4
1  5  6  7  8

In [16]:
b={'RollNo':pd.Series([1,2,3,4,5]),'Maths':pd.Series([60,70,81,93,50]),'Physics':pd.Series([40,81,22,93,100])}
df=pd.DataFrame(b)
df

   RollNo  Maths  Physics
0       1     60       40
1       2     70       81
2       3     81       22
3       4     93       93
4       5     50      100

In [5]:
b={'RollNo':[1,2,3,4,5],'Maths':[60,70,81,93,50],'Physics':[40,81,22,93,100]}
df=pd.DataFrame(b)
df

   RollNo  Maths  Physics
0       1     60       40
1       2     70       81
2       3     81       22
3       4     93       93
4       5     50      100

In [17]:
df=pd.read_csv(r'C:\Users\parul\Desktop\hi.csv')
df

   Name Roll number
0     1       Ankit
1     2      Ankush
2     3       Manik
3     4     Pradeep
4     5      Preeti

In [18]:
type(df)

pandas.core.frame.DataFrame